import { IFeedback } from "@/typings";

export const feedbacks: IFeedback[] = [
  {
    id: "1",
    name: "Дмитро Бондаренко",
    link: "@d_bondarenko",
    message:
      "Проходив курс HTML/CSS а потім і Джаваскріпт і можу сказати що це точно найкорисніше що проходив за останній час. Ніби не так і складно хоча думав раніше що не зрозумію. Дякую за пояснення.\n" +
      "Далі Реакт 😎",
    stars: 5,
    courses: ["Основи HTML5", "Основи CSS", "Основи JavaScript"],
  },
  {
    id: "2",
    name: "Дмитро Бондаренко",
    link: "@d_bondarenko",
    message:
      "Проходив курс HTML/CSS а потім і Джаваскріпт і можу сказати що це точно найкорисніше що проходив за останній час. Ніби не так і складно хоча думав раніше що не зрозумію. Дякую за пояснення.\n" +
      "Далі Реакт 😎",
    stars: 5,
    courses: ["Основи HTML5", "Основи CSS", "Основи JavaScript"],
  },
  {
    id: "3",
    name: "Дмитро Бондаренко",
    link: "@d_bondarenko",
    message:
      "Проходив курс HTML/CSS а потім і Джаваскріпт і можу сказати що це точно найкорисніше що проходив за останній час. Ніби не так і складно хоча думав раніше що не зрозумію. Дякую за пояснення.\n" +
      "Далі Реакт 😎",
    stars: 5,
    courses: ["Основи HTML5", "Основи CSS", "Основи JavaScript"],
  },
  {
    id: "4",
    name: "Дмитро Бондаренко",
    link: "@d_bondarenko",
    message:
      "Проходив курс HTML/CSS а потім і Джаваскріпт і можу сказати що це точно найкорисніше що проходив за останній час. Ніби не так і складно хоча думав раніше що не зрозумію. Дякую за пояснення.\n" +
      "Далі Реакт 😎",
    stars: 5,
    courses: ["Основи HTML5", "Основи CSS", "Основи JavaScript"],
  },
  {
    id: "5",
    name: "Дмитро Бондаренко",
    link: "@d_bondarenko",
    message:
      "Проходив курс HTML/CSS а потім і Джаваскріпт і можу сказати що це точно найкорисніше що проходив за останній час. Ніби не так і складно хоча думав раніше що не зрозумію. Дякую за пояснення.\n" +
      "Далі Реакт 😎",
    stars: 4,
    courses: ["Основи HTML5", "Основи CSS", "Основи JavaScript"],
  },
];
