export default async function Page() {
  return (
    <div>
      Умови надання послуг Будь ласка, уважно ознайомтесь з цими Умовами надання
      послуг ("Умови") перед використанням вебсайту Telychko frontend lab
      ("Сервіс"). 1. Прийняття Умов Користуючись Сервісом, ви погоджуєтеся з
      цими Умовами. Якщо ви не згодні з будь-якою частиною Умов, ви не можете
      користуватися Сервісом. 2. Обліковий запис Для доступу до певних функцій
      Сервісу вам потрібно буде увійти в систему через ваш обліковий запис
      Google. Ви несете відповідальність за збереження конфіденційності вашого
      облікового запису. 3. Правила користування Ви погоджуєтеся не
      використовувати Сервіс для будь-яких незаконних або заборонених цілей. Ви
      також погоджуєтеся не порушувати роботу Сервісу або доступ інших
      користувачів. 4. Інтелектуальна власність Весь контент, що знаходиться на
      Сервісі, включаючи тексти, графіку, логотипи, зображення та програмне
      забезпечення, є власністю [Назва вашої компанії/проєкту] та захищений
      законами про авторське право. 5. Припинення дії Ми залишаємо за собою
      право призупинити або припинити доступ до Сервісу без попереднього
      повідомлення, якщо ви порушили ці Умови. 6. Обмеження відповідальності
      Сервіс надається "як є". Ми не несемо відповідальності за будь-які прямі,
      непрямі або випадкові збитки, що виникають в результаті використання або
      неможливості використання Сервісу. 7. Зміни до Умов Ми залишаємо за собою
      право в будь-який час змінювати ці Умови. Продовжуючи користуватися
      Сервісом після публікації змін, ви погоджуєтеся з оновленими Умовами. 8.
      Контактна інформація Якщо у вас є запитання щодо цих Умов, будь ласка,
      зв'яжіться з нами: vitaliitelychkobusiness@gmail.com.
    </div>
  );
}
