import React from "react";
import styles from "./index.module.css";

interface CirclePlayProps {
  progress: number;
}

export default function CirclePlay({ progress }: CirclePlayProps) {
  const circleRadius = 14.5;
  const circumference = 2 * Math.PI * circleRadius;
  const strokeDashoffset = circumference - (progress / 100) * circumference;

  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="32"
      height="32"
      viewBox="0 0 32 32"
      fill="none"
    >
      <g clipPath="url(#clip0_43_2763)">
        {/* Тло кола */}
        <path
          d="M0 16C0 7.16344 7.16344 0 16 0C24.8366 0 32 7.16344 32 16C32 24.8366 24.8366 32 16 32C7.16344 32 0 24.8366 0 16Z"
          fill="white"
        />

        {/* Кнопка Play */}
        <path
          d="M21.5 15.134C22.1667 15.5189 22.1667 16.4811 21.5 16.866L14 21.1962C13.3333 21.5811 12.5 21.0999 12.5 20.3301L12.5 11.6699C12.5 10.9001 13.3333 10.4189 14 10.8038L21.5 15.134Z"
          fill="#49CA8E"
        />

        {/* Фонове коло */}
        <path
          d="M16 1.5C17.9042 1.5 19.7897 1.87505 21.5489 2.60375C23.3081 3.33244 24.9066 4.4005 26.253 5.74695C27.5995 7.0934 28.6676 8.69187 29.3963 10.4511C30.1249 12.2103 30.5 14.0958 30.5 16C30.5 17.9042 30.1249 19.7897 29.3963 21.5489C28.6676 23.3081 27.5995 24.9066 26.253 26.2531C24.9066 27.5995 23.3081 28.6676 21.5489 29.3963C19.7897 30.1249 17.9042 30.5 16 30.5C14.0958 30.5 12.2103 30.1249 10.4511 29.3963C8.69186 28.6676 7.0934 27.5995 5.74695 26.253C4.4005 24.9066 3.33244 23.3081 2.60374 21.5489C1.87505 19.7897 1.5 17.9042 1.5 16C1.5 14.0958 1.87506 12.2103 2.60375 10.4511C3.33244 8.69186 4.40051 7.09339 5.74696 5.74695C7.09341 4.4005 8.69188 3.33244 10.4511 2.60374C12.2103 1.87505 14.0958 1.5 16 1.5L16 1.5Z"
          className={styles.background}
          strokeWidth="3"
          strokeLinecap="round"
        />

        {/* Прогрес */}
        <path
          d="M16 1.5C18.5025 1.5 20.9625 2.14769 23.1405 3.38007C25.3186 4.61245 27.1406 6.38757 28.4294 8.53275C29.7182 10.6779 30.4298 13.1201 30.4951 15.6218C30.5603 18.1235 29.977 20.5995 28.8019 22.809C27.6267 25.0184 25.8997 26.8862 23.7889 28.2304C21.678 29.5747 19.2552 30.3498 16.7561 30.4803C14.2569 30.6108 11.7666 30.0922 9.52721 28.9751C7.28785 27.858 5.37574 26.1803 3.97687 24.1052"
          className={styles.progress}
          strokeWidth="3"
          strokeLinecap="round"
          strokeDasharray={circumference} // Загальна довжина кола (контроль прогресу)
          strokeDashoffset={strokeDashoffset} // Відступ: динамічний прогрес
        />
      </g>
      <defs>
        <clipPath id="clip0_43_2763">
          <path
            d="M0 16C0 7.16344 7.16344 0 16 0C24.8366 0 32 7.16344 32 16C32 24.8366 24.8366 32 16 32C7.16344 32 0 24.8366 0 16Z"
            fill="white"
          />
        </clipPath>
      </defs>
    </svg>
  );
}
