export default async function Page() {
  return (
    <div>
      Політика конфіденційності Ця Політика конфіденційності описує, як Telychko
      frontend lab ("Ми", "Нас", "Наш") збирає, використовує та захищає вашу
      інформацію, коли ви користуєтеся нашим вебсайтом. Інформація, яку ми
      збираємо Ми збираємо лише ту інформацію, яка необхідна для надання наших
      послуг. Коли ви входите на наш сайт за допомогою Google, ми отримуємо
      наступні дані: Ім'я Електронна пошта Зображення профілю (аватар)
      Ідентифікатор користувача Google (унікальний ідентифікатор) Ми не збираємо
      жодних інших особистих даних, таких як ваша стать, день народження або
      номер телефону, якщо ви їх не надаєте добровільно. Як ми використовуємо
      вашу інформацію Ваші дані використовуються виключно для наступних цілей:
      Аутентифікація: для підтвердження вашої особи та надання доступу до вашого
      облікового запису. Персоналізація: для надання вам персоналізованого
      досвіду, наприклад, відображення вашого імені та аватара. Облік прогресу:
      для відстеження вашого прогресу в курсах, якщо це передбачено функціоналом
      сайту. Ми не передаємо ваші особисті дані третім сторонам. Зберігання
      даних Ваші дані зберігаються в базі даних Firebase Firestore. Ми вживаємо
      розумних заходів для захисту вашої інформації від несанкціонованого
      доступу, зміни, розголошення або знищення. Політика щодо дітей Наші
      послуги не призначені для використання особами, які не досягли повноліття.
      Ми свідомо не збираємо особисту інформацію від дітей. Якщо нам стане
      відомо, що ми отримали такі дані, ми негайно їх видалимо. Зміни до цієї
      політики Ми можемо час від часу оновлювати цю Політику конфіденційності.
      Усі зміни будуть опубліковані на цій сторінці. Контактна інформація Якщо у
      вас є запитання щодо цієї Політики конфіденційності, будь ласка,
      зв'яжіться з нами: vitaliitelychkobusiness@gmail.com.
    </div>
  );
}
